<a href="https://colab.research.google.com/github/pkor725/-MTN-Cote-d-Ivoire/blob/master/Copy_of_Copy_of_Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Gideon_Cheruiyot_DataReport_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [7]:

dt = pd.read_csv('cells_geo.csv', delimiter = ';')
dt.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [10]:
dt = pd.read_csv('cells_geo.csv', delimiter = ';')
dt.head()
def function_1(val_1, value_11):
  return val_1
   # before retuning the values, we convert the first values into a string because values in one column are strings
dt['col_a'] = dt.apply(lambda row: function_1(row['VILLES'], row['SITE_CODE']) axis=1)
dt

SyntaxError: ignored

In [0]:
# join the three datasets representing data for the three days

dt1 = pd.read_csv('Telcom_dataset.csv')
dt1 = pd.DataFrame(dt1)

# second data set

dt2 = pd.read_csv('Telcom_dataset2.csv')
dt2 = pd.DataFrame(dt2)

# Third  data set

dt3 = pd.read_csv('Telcom_dataset3.csv')
dt3 = pd.DataFrame(dt3)

# combining the three datasets to one table
 
Frames = (dt1, dt2, dt3)
dt_all = pd.concat(Frames)
dt_all.head()

# Deleting row with missing values

dt_all2 = dt_all.dropna()
dt_all2
# Deleting
#Removing rows with duplicates.

dt_all3 = dt_all2.drop_duplicates()
dt_all3

#Drop row with no Geo-location identity.

#dt_all3.drop(dt_all3[dt_all3['SITE_ID'] == #NAME?])

#Dropping  columns not needed, 'CELL_ON_SITE', 'COUNTRY_A',	'COUNTRY_B'	

dt_all3.drop (columns = ['CELL_ON_SITE', 'COUNTRY_A','COUNTRY_B'])

     PRODUCT  VALUE DATE_TIME  ...      DW_B_NUMBER     CELL_ID     SITE_ID
0      Voice     51   01:10.0  ...  43da90b5116256b  c81af4d7e5   449817786
2      Voice      2   00:21.0  ...  245e7644b33c363  5139351fad  1113359465
3      Voice     40   00:22.0  ...  a5cc83245351838  5139351fad  1113359465
4      Voice     30   00:24.0  ...  863bcd3952cca84  5139351fad  1113359465
5      Voice     15   00:26.0  ...  8ab4721b68cbf2e  5139351fad  1113359465
...      ...    ...       ...  ...              ...         ...         ...
4995   Voice     10   01:43.0  ...  accc8e5c1164343  6467daa1db  8a96bae9c1
4996   Voice      0   01:43.0  ...  0ab2acd804d01fe  2aa04dcab7  f7d63a29e5
4997   Voice     62   01:43.0  ...  4c8098eb6ea1a41  7f1f2f889f  b4ddb9e93c
4999   Voice     30   01:43.0  ...  f9ff5af59cf0d68  98ed726da2  b4130b54ab
5000   Voice     60   01:43.0  ...  7e60838216482a7  1c11a2fcbb  6d70dae094

[12775 rows x 7 columns]

In [0]:
#Finding the most geo site with most active users

dt_all4 = dt_all3.groupby(['SITE_ID'])['SITE_ID'].count()
dt_all4.sort_values( ascending=False)

SITE_ID
7f76d66503    101
b47a998a3e     98
#NAME?         91
a7bd4c027b     79
5c565fbfb1     75
             ...
22d3978f25      1
RKmoAGwk+M      1
228ccfcacc      1
RRF4SIW9BU      1
910494ebd6      1
Name: SITE_ID, Length: 1346, dtype: int64

In [0]:
# to find out the most valuable Geo_site 

dt_all4 = dt_all3.groupby(['SITE_ID'])['VALUE'].sum()
dt_all4.sort_values( ascending=False)

SITE_ID
a64fc672f1    6929
MpOhP3OKNN    4225
2e828e607c    3662
5324bc6c24    3357
969b8d0e39    3309
              ...
955UPZQ91o       0
S028cV4N6t       0
S9cj3XAIWZ       0
1ad24d2151       0
P+LjgI3gTb       0
Name: VALUE, Length: 1346, dtype: int64

In [0]:
# To find out the most valuable product for MTN

dt_all4 = dt_all3.groupby(['PRODUCT'])['VALUE'].sum()
dt_all4.sort_values( ascending=False)

PRODUCT
Voice    293816
sms       52352
data       2001
Name: VALUE, dtype: int64

In [0]:
# To find out the most valuable product by geo-location

dt_all5 = dt_all3.groupby(['SITE_ID', 'PRODUCT'])['VALUE'].sum()
dt_all5

SITE_ID     PRODUCT
#NAME?      Voice      355
            data         1
            sms        125
+38u2u/rfx  Voice      222
            data        25
                      ...
ff1b78ec81  sms         50
ffa6bdc032  Voice      374
            sms        125
ffc9f56819  Voice      177
fff5ac6e3f  Voice       28
Name: VALUE, Length: 2467, dtype: int64